{
    "video_name": "wisconsin-vs-montana-clip.mp4",
    "total_frames": 115,
    "frames": [
        {
            "frame_number": 1,
            "text": "In the middle frame, the main subjects are engaged in a defensive play. The Wisconsin team is attempting to block or intercept the ball from the Montana team. The action includes:\n\n1. Wisconsin players are positioned defensively, with some players jumping to block the ball.\n2. Montana players are attempting to gain possession of the ball, with some players running towards the basket.\n3. The ball is in the process of being contested, with players from both teams vying for control.\n\nThe main subjects are not just their appearance but are actively involved in the defensive play, showcasing their athletic abilities and teamwork."
        },
        {
            "frame_number": 2,
            "text": "In the middle frame, the main subjects are engaged in a defensive play. The Wisconsin team is attempting to block or intercept the ball from the Montana team. The Wisconsin players are positioned in a defensive stance, with one player in a white jersey and another in a maroon jersey. The Montana players are spread out across the court, with some players in white jerseys and others in maroon jerseys. The action captured includes players jumping to block the ball, players running to advance the ball, and players in defensive positions. The scene is dynamic, with the intensity of the game evident in the players' postures and"
        },
        {
            "frame_number": 3,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is attempting to score. The player in the maroon jersey is also in motion, likely running towards the basket to take a shot. The player in the white jersey is also in motion, possibly preparing to defend or take a shot. The action captured includes the player's jump, the player's attempt to block the shot, and the player's subsequent movement towards the basket."
        },
        {
            "frame_number": 4,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the maroon jersey is jumping to block the shot, and the player in the white jersey is running towards the basket. The action captured includes the player's movement with the ball, the player's jump, and the player's running towards the basket."
        },
        {
            "frame_number": 5,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to make a shot, while the player in the maroon jersey is attempting to block the shot. The player in the maroon jersey is also in motion, running towards the basket. The action captured includes the player's jump, the player's attempt to block the shot, and the player's subsequent movement towards the basket."
        },
        {
            "frame_number": 6,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is attempting a layup. The player in the maroon jersey is running towards the basket. The action is dynamic, with the player in white attempting a layup and the player in maroon trying to block it. The player in white is also in motion, running towards the basket. The player in maroon is in motion, running towards the basket. The action is intense, with both players focused on scoring."
        },
        {
            "frame_number": 7,
            "text": "In the middle frame, we see a basketball player in a white jersey attempting to block a shot from a player in a maroon jersey. The player in white is jumping to reach the ball, while the player in maroon is trying to block or intercept. The player in white is also throwing the ball to his teammate. The player in maroon is running towards the ball, while the player in white is running towards the ball. The action captured is a crucial moment in the game, showcasing the defensive play and the offensive attempt by the white team."
        },
        {
            "frame_number": 8,
            "text": "In the middle frame, we see a basketball player in a white uniform attempting to block a shot from the opponent in a red uniform. The player is jumping to reach the ball, while the opponent is in motion, likely running towards the basket. The player in white is focused on the ball, while the player in red is in a defensive stance, ready to react. The action captures the intensity and physicality of the game, with the player in white attempting a defensive maneuver to block the shot."
        },
        {
            "frame_number": 9,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white uniform is dribbling the ball, while the player in the maroon uniform is attempting to defend. The player in white is jumping to block the shot, and the player in maroon is running towards the ball. The action is dynamic, with the player in white making a move to steal the ball, while the player in maroon is trying to prevent the steal. The player in white is also throwing the ball, and the player in maroon is running towards the ball. The action is fast-paced and intense, show"
        },
        {
            "frame_number": 10,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to catch the ball, while the player in the maroon jersey is running towards the basket. The player in the maroon jersey is also jumping, likely attempting a layup or a block. The action captured is a dynamic moment of the game, showcasing the athleticism and skill of the players involved."
        },
        {
            "frame_number": 11,
            "text": "In the middle frame, the main subjects are actively engaged in the basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is running towards the basket. The player in the maroon jersey is also jumping to block the shot. The player in the white jersey is running towards the basket, attempting to score. The action captured is a dynamic moment of play, with the player in white attempting to block the shot and the player in maroon trying to score."
        },
        {
            "frame_number": 12,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is running towards the basket. The player in the maroon jersey is also jumping to block the shot. The player in the white jersey is running towards the basket, attempting to score. The action between frames shows the player in white blocking the shot, the player in maroon blocking the shot, and the player in white running towards the basket."
        },
        {
            "frame_number": 13,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the red jersey is attempting to defend. The player in the red jersey is jumping to block the dribble. The player in the white jersey is running towards the basket. The action is dynamic, with the player in white moving forward, the player in red attempting to guard him, and the player in red running towards the basket. The scene captures the intensity and physicality of the game."
        },
        {
            "frame_number": 14,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is attempting to score. The player in the maroon jersey is running towards the basket. The action is dynamic, with the player in white attempting a defensive move and the player in maroon trying to score. The player in white is also in motion, likely preparing to defend or take a shot. The player in maroon is in motion, possibly running to the basket or preparing to make a play."
        },
        {
            "frame_number": 15,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the maroon jersey is running towards the basket. The action is dynamic, with the player in white moving forward while the player in maroon is trying to block the shot. The player in white is also jumping to reach the ball, while the player in maroon is running towards the basket. The scene captures the intensity and athleticism of the game."
        },
        {
            "frame_number": 16,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the maroon uniform is dribbling the ball, while the player in the white uniform is attempting to block the shot. The player in the white uniform is running towards the basket, while the player in the maroon uniform is standing near the basket, ready to receive the ball. The action is dynamic, with the player in white trying to outmaneuver the player in maroon, while the player in white is focused on securing the ball. The scene captures the intensity and athleticism of the game."
        },
        {
            "frame_number": 17,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The Wizards players are in various positions on the court, with some in defensive stances and others in offensive roles. The referee is also present, overseeing the action.\n\nBetween the frames, the players are in motion, with some jumping to block shots, others running to catch the ball, and others positioning themselves strategically. The intensity of the game is evident as players are focused on their next move.\n\nSpecific actions include:\n- Players in defensive stances, attempting to block shots.\n- Players running to catch the ball.\n- Players positioning"
        },
        {
            "frame_number": 18,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the white jersey is jumping to block the shot, and the player in the maroon jersey is running towards the basket. The action is dynamic, with the player in white moving forward, the player in maroon attempting to reach the basket, and the player in white trying to block the shot. The player in white is also in motion, running towards the basket, while the player in maroon"
        },
        {
            "frame_number": 19,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the maroon jersey is jumping to block the dribble. The referee is also present, closely observing the action. The main movement occurring is the dribbling of the ball by the player in white, with the player in maroon attempting to defend."
        },
        {
            "frame_number": 20,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the maroon uniform is dribbling the ball, while the player in the white uniform is attempting to defend. The player in the white uniform is jumping to block the dribble, and the player in the maroon uniform is running towards the basket. The action is dynamic, with the player in white making a defensive move and the player in maroon trying to evade."
        },
        {
            "frame_number": 21,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the maroon uniform is dribbling the ball, while the player in the white uniform is attempting to defend. The player in white is jumping to block the dribble, and the player in maroon is running towards the ball. The referee is also visible, overseeing the action."
        },
        {
            "frame_number": 22,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the white jersey is jumping to block the shot, and the player in the maroon jersey is running towards the basket. The action captured includes the player's movement with the ball, the defensive effort of the player in white, and the player's attempt to score."
        },
        {
            "frame_number": 23,
            "text": "In the middle frame, the main subjects are actively engaged in the basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is running towards the basket. The player in the white jersey is also in motion, likely preparing to receive a pass or defend. The player in the maroon jersey is running towards the basket, possibly to take a shot. The action captured includes the player's jump, the player's run towards the basket, and the player's jump to block the shot."
        },
        {
            "frame_number": 24,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the white jersey is jumping to block the shot, while the player in the maroon jersey is running towards the basket. The action is dynamic, with the player in white moving forward, the player in maroon attempting to reach the basket, and the player in white trying to block the shot. The scene captures the intensity and athleticism of the game."
        },
        {
            "frame_number": 25,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the maroon uniform is jumping to block a shot, while the player in the white uniform is running towards the basket. The player in the white uniform is also jumping, likely attempting to block or steal the ball. The player in the maroon uniform is running towards the basket, possibly to score. The action between frames shows the player in white attempting to steal the ball, while the player in maroon is defending the shot. The player in white is also jumping, likely preparing to make a pass or take a shot. The player in mar"
        },
        {
            "frame_number": 26,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the maroon uniform is jumping to block a shot, while the player in the white uniform is running towards the basket. The white team's player is also jumping to catch the ball. The action is dynamic, with the player in maroon attempting a defensive move and the player in white trying to score."
        },
        {
            "frame_number": 27,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to make a shot, while the player in the maroon jersey is attempting to block the shot. The player in the maroon jersey is running towards the basket. The action is dynamic, with the player in white making a jump and the player in maroon trying to defend. The player in white is also in motion, likely running to support his teammate or to take a shot. The player in maroon is focused on the ball, preparing to make a play."
        },
        {
            "frame_number": 28,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is attempting to score. The player in the white jersey is also running towards the basket. The action is dynamic, with the player in white jumping to block the shot, and the player in maroon running towards the basket. The player in white is also throwing the ball, and the player in maroon is running towards the basket. The action is fast-paced and intense, with the players' movements and positions indicating a critical moment in"
        },
        {
            "frame_number": 29,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the maroon jersey is jumping to block a shot, while the player in the white jersey is attempting to score. The player in the white jersey is running towards the basket. The action is dynamic, with the player in white attempting to score and the player in maroon trying to block. The player in white is also in motion, running towards the basket. The player in white is also jumping to block the shot. The player in maroon is also in motion, running towards the basket. The player in white is also jumping"
        },
        {
            "frame_number": 30,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The Wisconsin team is in possession of the ball, with players in white uniforms actively defending against the Grizzlies team in red uniforms.\n\nBetween the frames, the action includes:\n1. The Grizzlies team's defense, with players in white uniforms attempting to block or intercept the Grizzlies' offensive play.\n2. The Grizzlies team's offensive play, with players in white uniforms running towards the basket to score.\n3. The Grizzlies team's defense, with players in white uniforms attempting to block or tackle"
        },
        {
            "frame_number": 31,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey with the number 25 is in possession of the ball and appears to be dribbling or passing it. The player in the maroon jersey with the number 12 is closely guarding him, likely attempting to block or steal the ball. The player in the white jersey with the number 3 is positioned to defend against the player in the maroon jersey. The action captured includes the player in white moving forward with the ball, while the player in maroon is trying to maintain possession and defend."
        },
        {
            "frame_number": 32,
            "text": "In the middle frame, the main subjects are:\n\n1. A player from Montana, wearing jersey number 1, is running with the ball.\n2. A player from Wisconsin, wearing jersey number 32, is also running with the ball.\n3. The players are in motion, with Montana's player having his arm extended forward, likely preparing to pass or shoot.\n\nBetween the frames, there's a noticeable change in the players' positions. The Montana player is now closer to the camera, with his arm extended, while the Wisconsin player is slightly further away, still in motion.\n\nSpecific actions include:\n- Montana"
        },
        {
            "frame_number": 33,
            "text": "In the middle frame, the main subjects are engaged in a heated basketball game. The player in the white jersey, wearing jersey number 32, is in possession of the ball and appears to be dribbling or passing it. The player in the maroon jersey, number 1, is closely guarding him, likely attempting to block or steal the ball. The player in the white jersey is also wearing a headband, which is a common accessory for basketball players to keep sweat out of their eyes.\n\nBetween the frames, the action includes the player in white dribbling the ball, while the player"
        },
        {
            "frame_number": 34,
            "text": "In the middle frame, the main subjects are:\n\n1. A player from Montana, wearing jersey number 1, is running towards the camera.\n\n2. The player is in mid-stride, with one foot off the ground and the other foot planted, indicating movement.\n\n3. The player's focus is on the camera, suggesting engagement with the audience or the camera itself.\n\n4. The player's jersey is maroon with white lettering, displaying the Montana logo.\n\n5. The player's right arm is extended forward, possibly in a running motion.\n\n6. The player's left arm is slightly"
        },
        {
            "frame_number": 35,
            "text": "In the middle frame, the main subjects are actively engaged in the basketball game. The player in the white jersey is jumping to block a shot, while the player in the brown jersey is running towards the basket. The player in the white jersey is also in motion, possibly preparing to defend or take a shot. The player in the brown jersey is running towards the basket, likely attempting to score. The action captured is a dynamic moment of play, with the player in white attempting to defend and the player in brown trying to score."
        },
        {
            "frame_number": 36,
            "text": "In the middle frame, the main subjects are actively engaged in the game. The player in the white jersey is jumping to block a shot, while the player in the red jersey is running towards the basket. The player in the white jersey is also throwing the ball. The player in the red jersey is running towards the basket. The action captured is a defensive play by the player in white, attempting to block a shot, while the player in red is making a run to score."
        },
        {
            "frame_number": 37,
            "text": "In the middle frame, the main subjects are actively engaged in the basketball game. The player in the white jersey is jumping to block a shot, while the player in the red jersey is running towards the basket. The player in the white jersey is also throwing the ball, and the player in the red jersey is running towards the basket. The action captured includes the player's jump, the ball's movement, and the player's running motion."
        },
        {
            "frame_number": 38,
            "text": "In the middle frame, the main subjects are engaged in a defensive play. The player in the white jersey is attempting to block or intercept the ball from the player in the maroon jersey. The player in the white jersey is jumping to block the ball, while the player in the maroon jersey is running towards the ball. The action captured is a defensive maneuver to prevent the ball from advancing to the basket."
        },
        {
            "frame_number": 39,
            "text": "In the middle frame, the main subjects are engaged in a defensive play. The Wiltz Bears are attempting to block a shot from the Wisconsin team. The Wisconsin players are positioned to defend, with some players in the foreground and others in the background. The action involves the Wiltz Bears trying to prevent the Wisconsin team from scoring, while the Wisconsin players are focused on blocking the shot."
        },
        {
            "frame_number": 40,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the white jersey is also jumping to block the defender. The player in the maroon jersey is running towards the basket. The action between frames shows the player in white dribbling the ball, the player in maroon attempting to defend, and the player in white running towards the basket."
        },
        {
            "frame_number": 41,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The Wizards players are in various positions, with some jumping to block shots, others running to catch the ball, and a few in defensive stances. The referee is also present, overseeing the action.\n\nBetween the frames, the game is in progress. The Wizards are currently leading with a score of 3-2. The current score is 82-8, with the Wizards having 3 points and the Wizards having 2 points.\n\nThe action in the middle frame includes:\n1. The Wizards players are in"
        },
        {
            "frame_number": 42,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is attempting to score. The player in the white jersey is also in motion, likely running towards the basket to take a shot. The player in the maroon jersey is in the process of shooting the ball. The action captured is a dynamic moment of play, with the player in white attempting to defend against the shot, while the player in white is making an offensive move to score."
        },
        {
            "frame_number": 43,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the white jersey is also jumping to block the defender. The player in the maroon jersey is running towards the basket. The action between frames shows the player in white dribbling the ball, the player in white defending, and the player in white running towards the basket."
        },
        {
            "frame_number": 44,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to make a shot, while the player in the maroon jersey is running towards the basket. The player in the white jersey is also in motion, possibly preparing to defend or take a shot. The player in the maroon jersey is running towards the basket, likely attempting to score. The action captured is a dynamic moment of play, with the player in white making a jump shot and the player in maroon running towards the basket."
        },
        {
            "frame_number": 45,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the maroon jersey is jumping to block a shot, while the player in the white jersey is running towards the basket. The player in the white jersey is also jumping to block the shot. The action is focused on the offensive and defensive plays happening on the court."
        },
        {
            "frame_number": 46,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey with the number 25 is jumping to block a shot, while the player in the maroon jersey with the number 22 is attempting to make a pass. The player in the white jersey with the number 14 is also jumping to block the shot. The action captured is a defensive maneuver by the player in white to prevent the opposing team from scoring."
        },
        {
            "frame_number": 47,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey with the number 25 is jumping to block a shot, while the player in the maroon jersey with the number 22 is attempting to make a pass. The player in the white jersey with the number 3 is running towards the basket. The action captured includes the player's jump, the player's attempt to block the shot, and the player's running towards the basket."
        },
        {
            "frame_number": 48,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey with the number 22 is dribbling the ball, while the player in the maroon jersey with the number 25 is attempting to defend. The player in the white jersey with the number 25 is running towards the basket. The action between frames shows the player in white dribbling the ball, the player in maroon attempting to block, and the player in white running towards the basket."
        },
        {
            "frame_number": 49,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to make a shot, while the player in the maroon jersey is attempting to block the shot. The player in the maroon jersey is running towards the basket. The action is dynamic, with the player in white making a jump and the player in maroon trying to defend. The player in white is also in motion, likely running to support his teammate or to take a shot. The player in maroon is focused on the ball, preparing to make a play."
        },
        {
            "frame_number": 50,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to make a shot, while the player in the maroon jersey is running towards the basket. The player in the white jersey is also in motion, likely preparing to defend or take a shot. The player in the maroon jersey is running towards the basket, possibly to receive a pass or to defend. The action captured is a dynamic moment of play, showcasing the players' athleticism and the fast-paced nature of the game."
        },
        {
            "frame_number": 51,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the red jersey is attempting to defend. The player in the white jersey is jumping to block the shot, and the player in the red jersey is running towards the basket. The action is dynamic, with the player in white moving forward, the player in red attempting to reach the basket, and the player in white trying to prevent the shot. The player in red is also in motion, running towards the basket."
        },
        {
            "frame_number": 52,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the white jersey is jumping to block the shot, and the player in the maroon jersey is running towards the basket. The action is dynamic, with the player in white moving forward, the player in maroon attempting to reach the basket, and the player in white trying to prevent the shot. The player in white is also throwing the ball, while the player in maroon is catching it."
        },
        {
            "frame_number": 53,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white uniform is dribbling the ball, while the player in the maroon uniform is attempting to defend. The player in white is running towards the basket, and the player in maroon is positioned near the basket, ready to receive a pass. The action is dynamic, with the player in white moving forward, the player in maroon preparing to make a play, and the player in white moving towards the basket. The scene captures the intensity and athleticism of the game."
        },
        {
            "frame_number": 54,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the foreground is jumping to catch the ball, while other players are positioned around the court, either defending or preparing for the next move. The action captured includes the player's dynamic movement, with the jump and subsequent catch indicating a crucial moment in the game."
        },
        {
            "frame_number": 55,
            "text": "In the middle frame, the main subjects are actively engaged in the basketball game. The player in the white jersey is jumping to block a shot, while the player in the black jersey is running towards the basket. The player in the white jersey is also throwing the ball to a teammate. The player in the black jersey is running towards the basket, likely attempting to score. The action captured is a dynamic moment of play, showcasing the players' athleticism and teamwork."
        },
        {
            "frame_number": 56,
            "text": "In the middle frame, the main subjects are actively engaged in the game. The player in the white jersey is dribbling the ball, while the player in the red jersey is attempting to defend. The player in the red jersey is running towards the basket, and the player in the white jersey is running towards the basket. The player in the red jersey is also jumping to block the shot. The player in the white jersey is throwing the ball to the player in the red jersey. The player in the red jersey is running towards the basket, and the player in the white jersey is running towards"
        },
        {
            "frame_number": 57,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the white jersey is jumping to block the defender, and the player in the maroon jersey is running towards the basket. The action captured includes the player's movement with the ball, the defensive player's attempt to block, and the player's jump to reach the basket."
        },
        {
            "frame_number": 58,
            "text": "In the middle frame, the main subjects are actively engaged in the game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the maroon jersey is running towards the ball, while the player in the white jersey is positioned to block the defense. The referee is also visible, overseeing the play.\n\nBetween the frames, the action has changed as the player in the white jersey has successfully passed the ball to a teammate. The player in the maroon jersey is now attempting to steal the ball, while the"
        },
        {
            "frame_number": 59,
            "text": "In the middle frame, the main subjects are actively engaged in the basketball game. The player in the white jersey is dribbling the ball, while the player in the red jersey is attempting to defend. The player in the white jersey is also jumping to block the shot, and the player in the red jersey is running towards the basket. The referee is standing in position to make a call. The action between frames shows the player in white dribbling the ball, the player in red attempting to defend, and the player in white making a move to block the shot."
        },
        {
            "frame_number": 60,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the maroon jersey is running towards the ball, while the player in the white jersey is positioned to block the shot. The action captured includes the player's movement with the ball, the defensive stance of the player in white, and the player's running motion towards the ball."
        },
        {
            "frame_number": 61,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the red jersey is attempting to defend. The player in the red jersey is jumping to block the dribble, and the player in the white jersey is running towards the basket. The action is dynamic, with the player in white moving forward, the player in red attempting to counter, and the player in red running towards the basket. The scene captures the intensity and athleticism of the game."
        },
        {
            "frame_number": 62,
            "text": "In the middle frame, the main subjects are actively engaged in the game. The player in the white jersey is jumping to catch the ball, while the player in the maroon jersey is running towards the basket. The player in the maroon jersey is also jumping, likely attempting to block the shot. The player in the white jersey is running towards the basket, possibly trying to score. The action between frames shows the dynamic movement of the players, with the white-jerseyed player jumping for the ball and the maroon-jerseyed player running towards the basket."
        },
        {
            "frame_number": 63,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is running towards the basket. The player in the maroon jersey is also jumping to block the shot. The action is focused on the offensive and defensive plays, with the player in white attempting to score and the player in maroon trying to prevent it."
        },
        {
            "frame_number": 64,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the white jersey is jumping to block the shot, while the player in the maroon jersey is running towards the basket. The action is dynamic, with the player in white moving forward, the player in maroon attempting to reach the basket, and the player in white making a defensive move."
        },
        {
            "frame_number": 65,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is attempting to score. The player in the white jersey is also throwing the basketball, and the player in the maroon jersey is running towards the basket. The action captured includes the player's jump, the ball's trajectory, and the player's movement towards the basket."
        },
        {
            "frame_number": 66,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is attempting to score. The player in the white jersey is also running towards the basket. The action captured includes the player's jump, the player's attempt to block the shot, and the player's subsequent run towards the basket."
        },
        {
            "frame_number": 67,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is attempting to score. The player in the maroon jersey is running towards the basket. The action is dynamic, with the player in white attempting a defensive move and the player in maroon trying to score."
        },
        {
            "frame_number": 68,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the maroon jersey is running towards the basket. The action is dynamic, with the player in white moving forward while the player in maroon is trying to block the shot. The player in white is also jumping to reach the ball, and the player in maroon is running towards the basket. The scene captures the intensity and athleticism of the game."
        },
        {
            "frame_number": 69,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is running towards the basket. The player in the maroon jersey is also jumping to block the shot. The action is dynamic, with the player in white attempting to block the shot and the player in maroon trying to score. The player in white is also throwing the ball, while the player in maroon is holding the ball. The player in white is also running towards the basket, while the player in maroon is running towards the"
        },
        {
            "frame_number": 70,
            "text": "In the middle frame, the main subjects are actively engaged in the basketball game. The player in the white uniform is dribbling the ball, while the player in the maroon uniform is attempting to defend. The player in white is running towards the basket, and the player in maroon is positioned near the basket, ready to receive a pass. The action is dynamic, with the player in white moving forward, the player in maroon preparing to make a play, and the player in white moving towards the basket. The scene captures the intensity and movement of the game."
        },
        {
            "frame_number": 71,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white uniform is jumping to catch the ball, while the player in the maroon uniform is running towards the basket. The player in the white uniform is also in motion, likely preparing to pass or shoot. The player in the maroon uniform is running towards the basket, possibly to defend or take a shot. The action captured is a dynamic moment of play, showcasing the players' athleticism and teamwork."
        },
        {
            "frame_number": 72,
            "text": "In the middle frame, the main subjects are actively engaged in the basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is running towards the basket. The player in the white jersey is also throwing the basketball, and the player in the maroon jersey is running towards the basket. The action captured is a dynamic moment of play, with the player in white attempting to defend and the player in maroon trying to score."
        },
        {
            "frame_number": 73,
            "text": "In the middle frame, the main subjects are actively engaged in the basketball game. The player in the white jersey is jumping to block a shot, while the player in the maroon jersey is running towards the basket. The player in the red jersey is also in motion, likely attempting to defend or take a shot. The action captured includes the player's jump, the player's run towards the basket, and the player's attempt to block the shot. The scene is dynamic, showcasing the intensity and physicality of the game."
        },
        {
            "frame_number": 74,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the maroon uniform is dribbling the ball, while the player in the white uniform is attempting to defend. The player in white is running towards the basket, and the player in maroon is jumping to block the shot. The action is dynamic, with the player in white running towards the basket and the player in maroon jumping to block the shot. The player in white is also throwing the ball, while the player in maroon is jumping to block the shot. The player in white is running towards the basket, and the player in"
        },
        {
            "frame_number": 75,
            "text": "In the middle frame, the main subjects are engaged in a defensive play. The Wisconsin team is attempting to block or intercept the ball from the Montana team. The action includes:\n\n1. Wisconsin players are positioned defensively, with some players in the back and others in the middle of the court.\n2. Montana players are attempting to break through the defensive line, with some players jumping and others running towards the ball.\n3. Specific actions include Wisconsin players jumping to block the ball, Montana players running towards the ball, and Wisconsin players attempting to catch the ball.\n\nThe main subjects are not just their appearance but are actively involved in the"
        },
        {
            "frame_number": 76,
            "text": "In the middle frame, the main subjects are engaged in a dynamic basketball play. The player in the white jersey is jumping to block the shot, while the player in the maroon jersey is attempting to score. The player in the white jersey is also in motion, likely running towards the basket to take a shot. The player in the maroon jersey is in the process of shooting the ball. The action is captured in a moment of high tension, with the player in white attempting to defend and the player in maroon trying to score."
        },
        {
            "frame_number": 77,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to block the shot, while the player in the maroon jersey is attempting to score. The player in the maroon jersey is running towards the basket, while the player in the white jersey is defending. The action between frames shows the player in white jumping, the player in maroon attempting to score, and the player in white running towards the basket."
        },
        {
            "frame_number": 78,
            "text": "In the middle frame, the main subjects are engaged in a defensive play. The player in the maroon uniform is attempting to block or intercept the ball from the opposing team, who are wearing white uniforms. The action is dynamic, with the player in maroon positioned to either block or catch the ball, while the players in white are in various defensive stances. The player in white is likely trying to make a play, possibly a layup or a pass, while the player in maroon is trying to prevent the opposing team from scoring. The scene captures the intensity and physicality of the game, with players in motion and the crowd"
        },
        {
            "frame_number": 79,
            "text": "In the middle frame, the main subjects are engaged in a heated basketball play. The player in the white jersey is attempting to block or steal the ball from the player in the maroon jersey, who is on the ground. The player in white is jumping to reach the ball, while the player in maroon is trying to defend. The action is dynamic, with the white player's jump and the maroon player's defensive stance. The player in white is also throwing the ball to the player in maroon, indicating a strategic play. The scene captures the intensity and physicality of the game."
        },
        {
            "frame_number": 80,
            "text": "In the middle frame, the main subjects are engaged in a heated basketball game. The player in the white jersey is jumping and reaching out to grab the ball from the player in the maroon jersey. The player in white is also in motion, likely attempting to defend or pass the ball. The player in maroon is on the ground, possibly having fallen or attempted to block the play. The action captured is a dynamic moment of competition and physical contact in the game."
        },
        {
            "frame_number": 81,
            "text": "In the middle frame, the main subjects are engaged in a physical interaction on the basketball court. The player in the white jersey is jumping with his arms outstretched, attempting to grab the player in the maroon jersey. The player in the white jersey is also jumping, reaching out to assist. The action is dynamic, with the player in white's jump and the player in maroon's reach creating a sense of movement and competition."
        },
        {
            "frame_number": 82,
            "text": "In the middle frame, the main subjects are engaged in a heated basketball game. The player with the jersey number 22 is in the process of making a defensive move, likely attempting to block or intercept the pass. The player with the jersey number 31 is in a defensive stance, ready to react to the play. The action captured is a moment of intense competition between the two players, with the player in the red jersey attempting to gain possession of the ball."
        },
        {
            "frame_number": 83,
            "text": "In the middle frame, the main subjects are:\n\n1. A player wearing a white jersey with red lettering and the number 31, who is raising his right hand in a gesture that suggests he's signaling or communicating with someone.\n\n2. A player in a maroon jersey with the number 14, who is looking up at the player with the raised hand.\n\n3. A player in a white jersey with the number 3, who is observing the interaction between the two players.\n\n4. A player in a white jersey with the number 4, who is also looking up at the interaction"
        },
        {
            "frame_number": 84,
            "text": "In the middle frame, the main subjects are:\n\n1. A player from the Wisconsin team, wearing jersey number 3, is standing with his hands on his hips, looking down at the court.\n\n2. A player from the Montana team, wearing jersey number 9, is standing with his hands on his hips, looking down at the court as well.\n\n3. A player from the Wisconsin team, wearing jersey number 4, is standing with his hands on his hips, looking down at the court.\n\n4. A player from the Montana team, wearing jersey number 1, is standing with"
        },
        {
            "frame_number": 85,
            "text": "In the middle frame, the main subjects are engaged in a physical interaction. The player wearing jersey number 9 is in the process of grabbing or touching the player in jersey number 25. This action suggests a dynamic moment in the game, possibly a play or a defensive maneuver. The player in jersey number 25 is also in motion, likely running or moving towards the player in jersey number 9. The other players in the background appear to be observing the interaction, indicating that this is a significant moment in the game."
        },
        {
            "frame_number": 86,
            "text": "In the middle frame, the main subjects are engaged in a physical struggle for possession of the basketball. The player in the white jersey is attempting to dribble while being closely guarded by the player in the maroon jersey. The player in the maroon jersey is trying to block the dribble, while the player in the white jersey is trying to steal the ball. The action is dynamic, with the player in white attempting to gain control of the ball and the player in maroon trying to maintain possession. The player in white is jumping to reach the ball, while the player in maroon is running towards"
        },
        {
            "frame_number": 87,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to block the shot, while the player in the maroon jersey is attempting to pass the ball to a teammate. The player in the white jersey is also jumping, likely preparing to make a defensive move. The player in the maroon jersey is running towards the ball, possibly to receive a pass or defend against the shot. The action captured includes the players' dynamic movements, with the white-jerseyed player's jump and the maroon-jerseyed player's running."
        },
        {
            "frame_number": 88,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to block the shot. The player in the maroon jersey is running towards the ball, trying to gain possession. The player in the white jersey is also running, likely trying to support his teammate or create space. The action captured includes the player in white dribbling the ball, the player in maroon attempting to block, and the player in white running towards the ball. The player in maroon is also in motion"
        },
        {
            "frame_number": 89,
            "text": "In the middle frame, the main subjects are engaged in an intense basketball play. The player in the white jersey is leaping to block the shot, while the player in the maroon jersey is attempting a layup. The player in the white jersey is also in motion, likely preparing to make a pass or shoot. The action captured shows the player's athleticism and focus, with the player in white demonstrating agility and determination. The player in maroon is in a dynamic pose, indicating the fast pace of the game. The overall scene is filled with energy and competition."
        },
        {
            "frame_number": 90,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to make a shot, while the player in the maroon jersey is attempting to block the shot. The action is dynamic, with the player in white reaching for the ball, and the player in maroon preparing to defend. The player in white is in mid-air, and the player in maroon is positioned to intercept. The basketball is visible in the air, and the hoop is clearly visible in the background. The scene captures the intensity and athleticism of the game."
        },
        {
            "frame_number": 91,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is jumping to make a shot, while the player in the maroon jersey is attempting to block the shot. The player in the white jersey is also in motion, likely running towards the basket to take a shot. The action captured shows the dynamic movement of the players, with the player in white making a jump shot and the player in maroon trying to defend."
        },
        {
            "frame_number": 92,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey with the number 11 is jumping to block the shot, while the player in the maroon jersey with the number 3 is attempting to defend. The player in the white jersey with the number 31 is running towards the action, likely trying to assist in the defense. The player in the maroon jersey with the number 11 is also in motion, possibly preparing to make a play. The action is dynamic, with the player in white jumping and the player in maroon jersey in motion, show"
        },
        {
            "frame_number": 93,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player wearing jersey number 31 is jumping to make a shot, while the player in jersey number 11 is running towards the basket. The player in jersey number 32 is observing the action, likely preparing to defend or take over the ball. The other players are positioned around the court, ready to react to the outcome of the shot. The action captured is a dynamic moment of play, showcasing the athleticism and teamwork required in basketball."
        },
        {
            "frame_number": 94,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player wearing jersey number 31 is jumping to make a shot, while the player in jersey number 22 is attempting to block the shot. The player in jersey number 32 is observing the action, likely preparing to react. The main action is the player jumping to make the shot, while the player in the defensive stance is trying to block the shot. The player in jersey number 22 is running towards the basket to receive the rebound."
        },
        {
            "frame_number": 95,
            "text": "In the middle frame, the main subjects are:\n\n1. A referee is in the process of making a call, likely determining whether the basketball is in or out of bounds.\n2. The player in the white jersey with red lettering is jumping towards the basket, attempting to score.\n3. The player in the black jersey is also jumping, likely trying to block the shot or defend against the player in white.\n\nBetween the frames, the action includes:\n\n- The player in white is jumping to make a shot.\n- The player in black is jumping to block the shot.\n- The player in white is also"
        },
        {
            "frame_number": 96,
            "text": "In the middle frame, the main subjects are jumping and throwing the basketball. The referee is also jumping, likely in response to the action. The basketball is in mid-air, and the players are in various stages of motion, with some jumping and others throwing the ball. The referee's position suggests he is closely monitoring the play, ready to make a call."
        },
        {
            "frame_number": 97,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey with red lettering is jumping to make a shot, while the player in the purple jersey with white lettering is attempting to block the shot. The player in the black and white striped jersey is observing the action, likely preparing to react. The player in the purple jersey is running towards the basket, possibly to receive a pass or to defend against the shot. The action captured is a dynamic moment of play, showcasing the athleticism and quick reflexes required in basketball."
        },
        {
            "frame_number": 98,
            "text": "In the middle frame, the main subjects are:\n\n1. A basketball player from Wisconsin, wearing jersey number 31, who appears to be in the middle of a game.\n\n2. A player from Montana, wearing jersey number 3, who is standing in front of Wisconsin.\n\n3. A referee, who is standing behind the players.\n\n4. A crowd of spectators in the background, watching the game.\n\nThe main action occurring in the middle frame is the Wisconsin player from Wisconsin, number 31, making a play or preparing to make a move during the game. The Montana player from Wisconsin"
        },
        {
            "frame_number": 99,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the foreground is dribbling the basketball, while the player in the background is observing the action. The player in the foreground is wearing a white jersey with red lettering, indicating they are from Wisconsin. The player in the background is wearing a black jersey, suggesting they are from Missouri. The action captured is the player in the foreground dribbling the ball, while the player in the background is watching the play unfold."
        },
        {
            "frame_number": 100,
            "text": "In the middle frame, the main subjects are:\n\n1. The player from Wisconsin, wearing jersey number 21, is holding the basketball.\n2. The player from Missouri, wearing jersey number 3, is looking down at the basketball.\n3. The player from Wisconsin is looking down at the basketball, possibly preparing to make a play.\n\nBetween the frames, the action or change is the player from Wisconsin preparing to throw the basketball. The player from Missouri is observing the action, likely waiting for the right moment to make a play."
        },
        {
            "frame_number": 101,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the foreground is in a defensive stance, likely preparing to block or intercept a pass. The player in the background is in motion, possibly dribbling or running towards the basket. The player in the foreground is also in motion, possibly dribbling or running. The player in the background is in motion, possibly dribbling or running towards the basket. The player in the foreground is in motion, possibly dribbling or running towards the basket. The player in the background is in motion, possibly dribbling or running towards the basket"
        },
        {
            "frame_number": 102,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the white jersey is also preparing to pass the ball to a teammate. The player in the maroon jersey is running towards the ball, likely trying to score. The action between frames shows the player in white dribbling the ball, the player in white preparing to pass, and the player in white running towards the ball. The player in the maroon jersey is running towards the ball,"
        },
        {
            "frame_number": 103,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the white jersey is also jumping to block the shot, and the player in the maroon jersey is running towards the basket. The action captured includes the player's focused gaze on the ball, the player's dynamic movement, and the player's defensive stance."
        },
        {
            "frame_number": 104,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the foreground is jumping to make a shot, while the player in the background is attempting to block the shot. The player in the foreground is also in motion, likely running towards the basket to take a shot. The player in the background is also in motion, possibly preparing to defend or take a shot. The action captured is a dynamic moment of play, showcasing the athleticism and skill involved in basketball."
        },
        {
            "frame_number": 105,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the foreground is jumping to make a shot, while the player in the background is attempting to block the shot. The player in the foreground is also in motion, likely running towards the basket to continue the play. The player in the background is also in motion, possibly preparing to defend or take a shot. The action captured is a dynamic moment of play, showcasing the athleticism and skill involved in basketball."
        },
        {
            "frame_number": 106,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the foreground is jumping to block a shot, while the player in the background is attempting to make a pass. The player in the foreground is wearing a red jersey, and the player in the background is wearing a white jersey. The action captured is a defensive maneuver by the player in red to prevent a shot, with the player in white attempting to advance the ball."
        },
        {
            "frame_number": 107,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the red jersey is dribbling the ball, while the player in the white jersey is attempting to defend. The player in the red jersey is jumping to block the shot, and the player in the white jersey is running towards the basket. The action is dynamic, with the player in red moving quickly to intercept the ball, and the player in white trying to maintain possession. The player in red is also in motion, running towards the basket, while the player in white is positioned to either block or take a shot."
        },
        {
            "frame_number": 108,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the white jersey is jumping to block the shot, and the player in the maroon jersey is running towards the basket. The action is dynamic, with the player in white moving forward, the player in maroon attempting to reach the basket, and the player in white trying to block the shot. The scene captures the intensity and athleticism of the game."
        },
        {
            "frame_number": 109,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the foreground is jumping to block a shot, while the player in the background is running towards the basket. The player in the foreground is also throwing the ball, likely preparing to make a pass or take a shot. The player in the background is running towards the basket, possibly to receive a rebound. The action captured is a dynamic moment of play, showcasing the players' athleticism and teamwork."
        },
        {
            "frame_number": 110,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the foreground is jumping to catch the ball, while the player in the background is running towards the basket. The player in the foreground is also in motion, likely preparing to make a pass or take a shot. The player in the background is running towards the basket, possibly to defend or take a shot. The action captured is a dynamic moment of play, showcasing the players' athleticism and the fast-paced nature of the game."
        },
        {
            "frame_number": 111,
            "text": "In the middle frame, we see a player in a maroon uniform running towards the basket with the basketball. The player is in mid-stride, with one foot off the ground and the other foot planted on the court. The player's focus is on the basket, and their body language suggests they are preparing to make a shot. The player's arm is extended, and their eyes are fixed on the basket. The player's right leg is lifted off the ground, indicating a powerful jump. The player's left arm is slightly raised, possibly for balance. The player's right leg is firmly planted on the court, ready to push off"
        },
        {
            "frame_number": 112,
            "text": "In the middle frame, the main subjects are actively engaged in the basketball game. The player in the maroon jersey is jumping to block a shot, while the player in the white jersey is running towards the basket. The player in the white jersey is also jumping to block the shot. The player in the maroon jersey is running towards the basket. The action captured is a defensive maneuver by the player in the white jersey to block the shot, while the player in the maroon jersey is attempting to score."
        },
        {
            "frame_number": 113,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the maroon uniform is jumping to block a shot, while the player in the white uniform is attempting to score. The action is dynamic, with the player in white making a defensive move to contest the shot. The player in maroon is also in motion, likely running to open a scoring opportunity. The white-uniformed player is focused on the ball, preparing to make a play. The overall movement is energetic and competitive, capturing the intensity of the game."
        },
        {
            "frame_number": 114,
            "text": "In the middle frame, the main subjects are actively engaged in a basketball game. The player in the maroon uniform is jumping to block a shot, while the player in the white uniform is attempting to make a pass. The player in the white uniform is running towards the basket. The action is dynamic, with the player in white making a defensive move and the player in maroon attempting to defend."
        },
        {
            "frame_number": 115,
            "text": "In the middle frame, the main subjects are actively engaged in the basketball game. The player in the white jersey is dribbling the ball, while the player in the maroon jersey is attempting to defend. The player in the white jersey is jumping to block the shot, and the player in the maroon jersey is running towards the basket. The action captured includes the player's dynamic movement, with the ball in motion and the player's body leaning forward, indicating an attempt to make a play."
        }
    ],
    "status": "complete"
}